<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DaeraSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('daeras')->delete();
        DB::table('daeras')->insert([
            [
                "id"=> 950,
                "name"=> "دائرة المدارس الشرعية",
                "parent_id"=> 949
            ],
            [
                "id"=> 952,
                "name"=> "مديرية أوقاف محافظة غزة",
                "parent_id"=> 947
            ],
            [
                "id"=> 956,
                "name"=> "مديرية أوقاف محافظة الوسطي",
                "parent_id"=> 947
            ],
            [
                "id"=> 961,
                "name"=> "مديرية أوقاف محافظة خانيونس",
                "parent_id"=> 947
            ],
            [
                "id"=> 962,
                "name"=> "دائرة الحسابات",
                "parent_id"=> 955
            ],
            [
                "id"=> 968,
                "name"=> "دائرة الهندسة والانشاءات",
                "parent_id"=> 967
            ],
            [
                "id"=> 970,
                "name"=> "دائرة الاعلام ",
                "parent_id"=> 948
            ],
            [
                "id"=> 975,
                "name"=> "دائرة شؤون الموظفين",
                "parent_id"=> 1172
            ],
            [
                "id"=> 978,
                "name"=> "دائرة أنظمة وتطبيقات الانترنت",
                "parent_id"=> 972
            ],
            [
                "id"=> 980,
                "name"=> "مديرية أوقاف محافظة الشمال",
                "parent_id"=> 947
            ],
            [
                "id"=> 985,
                "name"=> "دائرة الصيانة",
                "parent_id"=> 1172
            ],
            [
                "id"=> 987,
                "name"=> "مديرية أوقاف محافظة رفح",
                "parent_id"=> 947
            ],
            [
                "id"=> 1004,
                "name"=> "دائرة الشبكات والدعم الفني",
                "parent_id"=> 972
            ],
            [
                "id"=> 1025,
                "name"=> "كلية الدعوة الإسلامية - المقر الرئيسي",
                "parent_id"=> 949
            ],
            [
                "id"=> 1026,
                "name"=> "دائرة الاذاعة والقناة الالكترونية",
                "parent_id"=> 948
            ],
            [
                "id"=> 1029,
                "name"=> "دائرة الموازنة والتدقيق",
                "parent_id"=> 1182
            ],
            [
                "id"=> 1031,
                "name"=> "دائرة العلاقة العامة",
                "parent_id"=> 948
            ],
            [
                "id"=> 1036,
                "name"=> "دائرة الدعوة المجتمعية والالكترونية",
                "parent_id"=> 1035
            ],
            [
                "id"=> 1038,
                "name"=> "دائرة المخازن",
                "parent_id"=> 1182
            ],
            [
                "id"=> 1041,
                "name"=> "مكتب الوكيل",
                "parent_id"=> 1300
            ],
            [
                "id"=> 1042,
                "name"=> "دائرة الحسابات والايرادات",
                "parent_id"=> 1182
            ],
            [
                "id"=> 1048,
                "name"=> "دائرة البحث الاجتماعي ",
                "parent_id"=> 955
            ],
            [
                "id"=> 1062,
                "name"=> "كلية الدعوة الإسلامية - مقر الشمال",
                "parent_id"=> 949
            ],
            [
                "id"=> 1065,
                "name"=> "دائرة المقابر",
                "parent_id"=> 967
            ],
            [
                "id"=> 1069,
                "name"=> "دائرة الدعوة المسجدية",
                "parent_id"=> 1035
            ],
            [
                "id"=> 1075,
                "name"=> "دائرة الدعوة والإرشاد -اناث",
                "parent_id"=> 1035
            ],
            [
                "id"=> 1084,
                "name"=> "الدائرة العلمية",
                "parent_id"=> 949
            ],
            [
                "id"=> 1088,
                "name"=> "دائرة السياسات والتخطيط",
                "parent_id"=> 966
            ],
            [
                "id"=> 1091,
                "name"=> "دائرة الرقابة الدينية والفنية",
                "parent_id"=> 1072
            ],
            [
                "id"=> 1097,
                "name"=> "دائرة الخدمات والمواصلات",
                "parent_id"=> 1172
            ],
            [
                "id"=> 1101,
                "name"=> "دائرة الحج والعمرة وتأهيل الشركات",
                "parent_id"=> 1100
            ],
            [
                "id"=> 1104,
                "name"=> "دائرة مشاريع الوقف",
                "parent_id"=> 977
            ],
            [
                "id"=> 1105,
                "name"=> "دائرة التراث الاسلامي",
                "parent_id"=> 947
            ],
            [
                "id"=> 1108,
                "name"=> "دائرة تطوير الأداء المؤسسي",
                "parent_id"=> 966
            ],
            [
                "id"=> 1110,
                "name"=> "دائرة القراءات القرآنية",
                "parent_id"=> 974
            ],
            [
                "id"=> 1117,
                "name"=> "دائرة الأملاك",
                "parent_id"=> 967
            ],
            [
                "id"=> 1121,
                "name"=> "دائرة القرآن الكريم -إناث",
                "parent_id"=> 974
            ],
            [
                "id"=> 1131,
                "name"=> "دائرة البرمجيات وإدارة قواعد البيانات",
                "parent_id"=> 972
            ],
            [
                "id"=> 1146,
                "name"=> "دائرة المشتريات",
                "parent_id"=> 1182
            ],
            [
                "id"=> 1152,
                "name"=> "دائرة الاستثمار",
                "parent_id"=> 977
            ],
            [
                "id"=> 1165,
                "name"=> "دائرة المتابعة",
                "parent_id"=> 1100
            ],
            [
                "id"=> 1177,
                "name"=> "دائرة التحفيظ -ذكور",
                "parent_id"=> 974
            ],
            [
                "id"=> 1181,
                "name"=> "مكتب الوزير",
                "parent_id"=> 1301
            ],
            [
                "id"=> 1191,
                "name"=> "دائرة الحاسوب وتكنولوجيا المعلومات",
                "parent_id"=> 972
            ],
            [
                "id"=> 1210,
                "name"=> "دائرة الرقابة المالية",
                "parent_id"=> 1072
            ],
            [
                "id"=> 1214,
                "name"=> "دائرة مالية الحج والعمرة",
                "parent_id"=> 1100
            ],
            [
                "id"=> 1219,
                "name"=> "دائرة ديوان الحفاظ",
                "parent_id"=> 974
            ],
            [
                "id"=> 1222,
                "name"=> "دائرة صندوق الزكاة",
                "parent_id"=> 955
            ],
            [
                "id"=> 1368,
                "name"=> "قسم التنسيق والمتابعة",
                "parent_id"=> 947
            ],
            [
                "id"=> 1435,
                "name"=> "دائرة الانشطة والفعاليات",
                "parent_id"=> 1423
            ],
            [
                "id"=> 1442,
                "name"=> "دائرة التوثيق والاصدارات",
                "parent_id"=> 1423
            ],
            [
                "id"=> 1450,
                "name"=> "دائرة متابعة المساجد",
                "parent_id"=> 947
            ]
        ]);
    }
}
